<template>
  <div class="row">
    <div class="col-xl-8">
      <div class="template-title mb-5">
        Требования к верстки эталонов
      </div>
      <div class="template-text mb-3">
        Верстка всех новых лендингов и прелендингов должна быть адаптивной к тексту и переводам,
        блоки с текстом должны тянуться при изменении контента, картинки должны легко заменяться, верстка не
        должна разваливаться при изменении контента на сайте. При изменении кол-ва текста, он должен
        выравниваться, в случае если это невозможно нужно оставить возможность быстро и легко изменить
        размер шрифта для адаптации.
      </div>
      <div class="template-text mb-3">
        В обязательном порядке на лендингах проставляются цены с помощью системных переменных и классов указанных
        в документации к adcombo или ctr, перед заливкой лендинга и после необходимо проверять правильность
        расстановки и подгрузки цен на лендинг.
      </div>
      <div class="template-text mb-3">
        При верстке лендингов не рекомендуется объединять фотографии врачей, девушек и фотографии упаковок товара с фоном, так как при адаптации под другие страны возникает сложность быстро и легко адоптировать лендинг.
      </div>
      <div class="template-text mb-3">
        В форме лендингов нужно учитывать возможность добавить доставку и стоимость итого. На кнопки нужно обязательно добавлять анимацию с эффектом увеличения, или любую другую, если по дизайну не предусмотрен иной эффект.
      </div>
      <div class="template-code mt-10 mb-10">
        <pre v-highlightjs>
          <code class="js">
            const s = new Date().toString()
          </code>
        </pre>
      </div>
      <div class="template-text mb-3"></div>
      <div class="template-text mb-3"></div>
      <div class="template-text mb-3"></div>
      <div class="template-text mb-3"></div>
      <div class="template-text mb-3"></div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'layout'
}
</script>
